package com.wanghanjin.maps;


/**
 * 实现 地图接口   而且必须拥有  这几个元素
 * @author 故事与猫
 *
 */
public class BaseMap2 implements Mapable{

	public static int[][] walls = {
		{1,1},
		{2,1},
		{3,1},
		{4,1},
		{5,1},
		{6,1},
		{7,1},
		{8,1},
		{9,1},
		{10,1},
		{11,1},
		{12,1},
		{13,1},
		
		//Home的保护墙
		{7+1,9},
		{7-1,9},
		{7+1,8},
		{7-1,8},
		{7,8},
	};
	
	public static int[][] steels = {
		
		{1,3},
		{2,3},
		{3,3},
		{4,3},
		{5,3},
		{6,3},
		{7,3},
		{8,3},
		{9,3},
		{10,3},
		{11,3},
		{12,3},
		{13,3},

	};
	
	public static int[][] waters = {

		{1,5},
		{2,5},
		{3,5},
		{4,5},
		{5,5},
		{6,5},
		{7,5},
		{8,5},
		{9,5},
		{10,5},
		{11,5},
		{12,5},
		{13,5},

	};
	
	public static int[][] grasss = {

		{1,7},
		{2,7},
		{3,7},
		{4,7},
		{5,7},
		{6,7},
		{7,7},
		{8,7},
		{9,7},
		{10,7},
		{11,7},
		{12,7},
		{13,7},

	};
	
	
	//Home对象
	public static int[][] home = {

		{7,9},

	};
}
