package com.wanghanjin.maps;

public class Name implements Mapable{
	
	
	
		public static int[][] walls = {
			
				{17,1},
				{17,2},
				{17,3},
				{17,4},
				{17,5},
				{17,6},
				{17,7},
				{17,8},
				
				
				{16,8},
				{15,8},
				{14,8},
				{13,8},
				
				{13,7},
		};
		
		public static int[][] steels = {
				
				

		};
		
		public static int[][] waters = {
				
				{7,1},
				{7,2},
				{7,3},
				{7,4},
				{7,5},
				{7,6},
				{7,7},
				{7,8},

				{11,1},
				{11,2},
				{11,3},
				{11,4},
				{11,5},
				{11,6},
				{11,7},
				{11,8},
				
				
				{8,4},
				{9,4},
				{10,4},
		};
		
		public static int[][] grasss = {
				
				{1,1},
				{1,2},
				{1,3},
				{1,4},
				{1,5},
				{1,6},
				{1,7},
				{1,8},
				
				{2,7},
				
				{3,6},
				
				{4,7},
				
				{5,1},
				{5,2},
				{5,3},
				{5,4},
				{5,5},
				{5,6},
				{5,7},
				{5,8},
				
		};
		
		
		//Home对象
		public static int[][] home = {
				
			
		};
		
}
